Revit 2027 API
ICentralLockedCallback Interface
 An interface that may be used to control Revit's behavior when it tries to lock central and is blocked because another user already has locked central.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public interface ICentralLockedCallback
Public Interface ICentralLockedCallback
public interface class ICentralLockedCallback
type ICentralLockedCallback = interface end
The ICentralLockedCallback type exposes the following members.
Methods
Name | Description
ShouldWaitForLockAvailability |  Returns whether Revit should wait and try again to acquire the lock on central.
Top
See Also
Reference
Autodesk.Revit.DB Namespace